//Напишите программу, которая на вход принимает
//число и выдает его квадрат (число умноженное
//на само себя).

//Например
//4->16
//3->9
//7->49

//Решение
//1.Принять число
//2.Посчитать квадрат
//3.Вывести получившийся результат

//int number = 8;
//int result = number*number;
//Console.WriteLine(result);

//Console.WriteLine("Введите число");
//string input = Console.ReadLine();
//int number = Convert.ToInt32 (input);//преобразует строку в число
//int result = number*number;
//Console.WriteLine (result);

Console.WriteLine("Введите число");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine (number1 * number1);




