// Написать программу которая на вход принимает число (N), а на выходе показывает все целые числа в промежутке от -N до N

// Console.WriteLine("Введите число N");
// int N = Convert.ToInt32(Console.ReadLine());
// int count=0 ;

// while (count < N)
// {
//     Console.WriteLine(count);
//     count = count++;
// }

Console.WriteLine ("Ввод");
int A = Convert.ToInt32(Console.ReadLine());
int R = A%100;
Console.WriteLine(R);

